//=============================================================
// Scene.h
// シーンクラスの定義
//=============================================================

#ifndef _Scene_h_
#define _Scene_h_

#include "Common.h"

//=============================================================
// 依存するクラス
//=============================================================

//=============================================================
// Scene
// シーンクラス
//=============================================================
class Scene
{
public:
	//---------------------------------------------------------
	// デフォルトコンストラクタ
	//---------------------------------------------------------
	Scene();

	//---------------------------------------------------------
	// デストラクタ
	//---------------------------------------------------------
	~Scene();

public:
	//---------------------------------------------------------
	// シーンを生成
	// 引数
	//		pD3DDevice : IDirect3DDevice9 インターフェイスへのポインタ
	// 戻り値
	//		成功したらS_OK
	//---------------------------------------------------------
	HRESULT Create(LPDIRECT3DDEVICE9 pD3DDevice);

	//---------------------------------------------------------
	// 座標変換を行う
	// 引数
	//		pD3DDevice : IDirect3DDevice9 インターフェイスへのポインタ
	//---------------------------------------------------------
	void Transform(LPDIRECT3DDEVICE9 pD3DDevice);

	//---------------------------------------------------------
	// 描画
	// 引数
	//		pD3DDevice : IDirect3DDevice9 インターフェイスへのポインタ
	//---------------------------------------------------------
	void Draw(LPDIRECT3DDEVICE9 pD3DDevice);

	//---------------------------------------------------------
	// シーンの破棄
	//---------------------------------------------------------
	void Destroy();

private:

	// マトリックス
	D3DXMATRIX	m_proj;		// カメラの画角など
	D3DXMATRIX	m_view;		// カメラの配置
	D3DXMATRIX	m_world;	// モデルの配置

	// 頂点バッファー
	LPDIRECT3DVERTEXBUFFER9		m_pMyVB;

	// 頂点データの構造体
	struct MY_VERTEX{
		D3DXVECTOR3 p;		// 位置
		DWORD		color;	// デフューズ色
	};

	// 頂点データのＦＶＦフォーマットの設定
	#define MY_VERTEX_FVF  (D3DFVF_XYZ | D3DFVF_DIFFUSE )
};

#endif // _Scene_h_