#include "Ending.h"


//-----------------------------------------------------------------
//初期化処理
//-----------------------------------------------------------------
void	Ending::Initialize()
{
	font.Create(TEXT("MS ゴシック"), 12, 12);
}


//-----------------------------------------------------------------
//解放処理
//-----------------------------------------------------------------
void	Ending::Finalize()
{
	font.Destory();
	MessageBox(NULL, TEXT("エンディング画面が終了します"), TEXT("Ending"), MB_OK);
}


//-----------------------------------------------------------------
//更新処理
//-----------------------------------------------------------------
Task	Ending::UpDate()
{
	key = input.GetKeyState();

	Task	nextTask = Task::End;
	if (key[DIK_V] & 0x80)
	{
		nextTask = Task::Title;
	}
	return nextTask;

	return Task::End;
}


//-----------------------------------------------------------------
//描画処理
//-----------------------------------------------------------------
void	Ending::Render()
{
	font.Render(TEXT("エンディング画面です"), Box2D(0, 0, 200, 50), D3DXCOLOR(1, 1, 1, 1));
}
